olikraus/u8g2/sys/arm/stm32l031x6/clock/main.c
/* 

  Clock for the STM32L031 
  
  EXTI line
  17			RTC alarm
  19			RTC tamper & timestamp & CSS_LSE
  20			RTC wakeup timer
  
  PA0 TAMP2	Button
  PA2 TAMP3	Button


  __enable_irq();
  __disable_irq();
  
*/

#include "stm32l031xx.h"
#include "delay.h"
#include "u8g2.h"
//#include "rtc.h"
#include "key.h"
#include "gui.h"

/*=======================================================================*/
/* Configuration */
/* Note: 50ms systick */

/* delay until other another button press is accepted */
/* time is in systicks (50ms) */
#define TAMPER_SYSTICK_DELAY 20

/* delay until the menu goes back time display and standby mode */
/* delay in systicks (50ms) */
/* 50ms*20 = 1 second */
/* 50ms*20*10 = 10 second */
/* 50ms*20*18 = 18 second */
#define MENU_IDLE_SYSTICK_TIMEOUT (20*18)

/* wakeup period: The uC will wake up after the specified number of seconds */
/* the value is one less the intended number of seconds: */
/* 0: wakeup every 1 second */
/* 14: wakeup every 15 seconds */
/* 29: wakeup every 30 seconds */
/* After wakeup the uC will refresh the display and check for the alarms. This means the wakeup time should not be */
/* more than 1 minute. There might be also a delay of up to WAKEUP_PERIOD+1 seconds until the alarm is detected. */
/* Large values reduce power consumtion, but displayed time and alarm might be later than the actual RTC time. */
#define WAKEUP_PERIOD 14


/* Contrast value for the display in normal mode (u8g2_SetContrast). */
/* 208: default value for the SSD1306 */
#define DISPLAY_CONTRAST_NORMAL 210 

/* Contrast value for the display in standby mode, if the display mode DISPLAY_STANDBY_MODE_REDUCED is aktive. */
/* 208: default value for the SSD1306, value 0 still shows something on the display */
#define DISPLAY_CONTRAST_REDUCED 5 


/* the following variable defines the behavior of the display during standby of the uC */
#define DISPLAY_STANDYB_MODE_ALWAYS_ON 0
#define DISPLAY_STANDBY_MODE_REDUCED 1
#define DISPLAY_STANDBY_MODE_OFF 2
volatile unsigned long DisplayStandbyMode = DISPLAY_STANDBY_MODE_OFF;


/*=======================================================================*/
/* external functions */
uint8_t u8x8_gpio_and_delay_stm32l0(u8x8_t *u8x8, uint8_t msg, uint8_t arg_int, void *arg_ptr);


/*=======================================================================*/
/* global variables */

#define RESET_REASON_POR 0
#define RESET_REASON_NVIC_RESET 1
#define RESET_REASON_TAMP2 2
#define RESET_REASON_TAMP3 3
#define RESET_REASON_WUF 4



volatile unsigned long SysTickCount = 0;
volatile unsigned long RTCWUCount = 0;
volatile unsigned long RTCIRQCount = 0;
volatile unsigned long isIgnoreNextKey = 0;
volatile unsigned long Tamper2Count = 0;
volatile unsigned long Tamper3Count = 0;
volatile unsigned long MenuIdleTimer = 0;
volatile unsigned long PWR_CSR_Backup;
volatile unsigned long ResetReason = RESET_REASON_POR;


//rtc_t rtc;
u8g2_t u8g2;


/*=======================================================================*/

void __attribute__ ((interrupt, used)) SysTick_Handler(void)
{
  int is_t2 = 0;
  int is_t3 = 0;

  SysTickCount++;  
  
  /* read the tamper/button state */
  /* this is more complicated, because there are no external pull ups for the buttons */
  /* pull ups can be activated via GPIO, but are disabled if the pin is configured as tamper input */
  /* As a consequence, we have to disable tamper (so that the internal pullups are active), then */
  /* after some delay, get the GPIO value of the tamper input and restore tamper status */

  if ( Tamper2Count > 0 || Tamper3Count > 0 )
  {
    RTC->WPR = 0x0ca;					/* disable RTC write protection */
    RTC->WPR = 0x053;

    RTC->TAMPCR &= ~RTC_TAMPCR_TAMP2E;	/* disable tamper  so that we can do normal GPIO access */
    RTC->TAMPCR &= ~RTC_TAMPCR_TAMP3E;	/* disable tamper  so that we can do normal GPIO access */
    __NOP();							/* add delay after disable tamper so that GPIO can read the value */
    __NOP();

    is_t2 = (GPIOA->IDR & GPIO_IDR_ID0) != 0 ? 1 : 0;
    is_t3 = (GPIOA->IDR & GPIO_IDR_ID2) != 0 ? 1 : 0;

    RTC->TAMPCR |= RTC_TAMPCR_TAMP2E;	/* enable tamper */
    RTC->TAMPCR |= RTC_TAMPCR_TAMP3E;	/* enable tamper */

    RTC->WPR = 0;						/* enable RTC write protection */
    RTC->WPR = 0;
  }
  
  if ( Tamper3Count > 0 )
  {
    Tamper3Count--;
    /* check for timeout or whether the user has released the button */
    if ( Tamper3Count == 0 || is_t3 )
    {
      Tamper3Count = 0;
      RTC->ISR &= ~RTC_ISR_TAMP3F;		/* clear tamper flag, allow new tamper event */
    }
  }
  else
  {
     RTC->ISR &= ~RTC_ISR_TAMP3F;		/* clear tamper flag, allow new tamper event */
  }

  if ( Tamper2Count > 0 )
  {
    Tamper2Count--;
    /* check for timeout or whether the user has released the button */
    if ( Tamper2Count == 0 || is_t2)
    {
      Tamper2Count = 0;
      RTC->ISR &= ~RTC_ISR_TAMP2F;		/* clear tamper flag, allow new tamper event */
    }
  }
  else
  {
      RTC->ISR &= ~RTC_ISR_TAMP2F;		/* clear tamper flag, allow new tamper event */
  }

  MenuIdleTimer++;
  
}

void __attribute__ ((interrupt, used)) RTC_IRQHandler(void)
{
  //enableRCCRTCWrite();
    
  if ( (EXTI->PR & EXTI_PR_PIF20) != 0 )	/* interrupt caused by wake up */
  {
    EXTI->PR = EXTI_PR_PIF20;		/* wake up is connected to line 20, clear this IRQ */
    RTCWUCount++;
  }
  
  /* the wake up time flag must be cleared, otherwise no further IRQ will happen */
  /* in principle, this should happen only when a IRQ line 20 IRQ happens, but */
  /* it will be more safe to clear this flag for any interrupt */
  
  RTC->ISR &= ~RTC_ISR_WUTF;	/* clear the wake up flag */

  
  if ( (EXTI->PR & EXTI_PR_PIF19) != 0 )	/* interrupt caused by tamper event */
  {
    EXTI->PR = EXTI_PR_PIF19;		/* clear tamper IRQ */
    
    /* The TAMPxF flag has to be cleared, but this is done in the systick handler after some delay */
    //RTC->ISR &= ~RTC_ISR_TAMP3F;
    //RTC->ISR &= ~RTC_ISR_TAMP2F;
    
    if ( RTC->ISR & RTC_ISR_TAMP3F )
    {
      if ( isIgnoreNextKey == 0 )
      {
	key_add(KEY_NEXT);
      }
      isIgnoreNextKey = 0;
      MenuIdleTimer = 0;
      Tamper3Count = TAMPER_SYSTICK_DELAY;
    }
    if ( RTC->ISR & RTC_ISR_TAMP2F )
    {
      if ( isIgnoreNextKey == 0 )
      {
	key_add(KEY_SELECT);
      }
      isIgnoreNextKey = 0;
      MenuIdleTimer = 0;
      Tamper2Count = TAMPER_SYSTICK_DELAY;
    }
    
