olikraus/u8g2/sys/arm/stm32l031x6/clock/main.c
  r = RTC->TR;

  i = 0;
  do
  {
    bcd[i] = r & 15;
    r >>= 4;
    i++;
  } while( i < 6 );
  
  bcd[1] &= 7;	/* seconds */
  bcd[3] &= 7;	/* minutes */
  bcd[5] &= 3; /* hours */

  gui_data.h = bcd[4]  + bcd[5]*10;;
  gui_data.mt = bcd[3];
  gui_data.mo = bcd[2];
  gui_data.st = bcd[1];
  gui_data.so = bcd[0];


  r = RTC->DR;
  i = 0;
  do
  {
    bcd[i] = r & 15;
    r >>= 4;
    i++;
  } while( i < 6 );

  bcd[1] &= 3;	/* days */
  bcd[3] &= 1;	/* months */  

  gui_data.day = bcd[0] + bcd[1]*10;
  gui_data.month = bcd[2] + bcd[3]*10;
  gui_data.year_o = bcd[4];
  gui_data.year_t = bcd[5];
  
  
  gui_date_adjust();	/* calculate weekday */
  //gui_Recalculate();  /* this will also store the values back in the backup registers */
}

void enterStandByMode(void)
{
  MenuIdleTimer = 0;
  
  if ( DisplayStandbyMode == DISPLAY_STANDBY_MODE_REDUCED )
    u8g2_SetContrast(&u8g2, DISPLAY_CONTRAST_REDUCED);

  if ( DisplayStandbyMode == DISPLAY_STANDBY_MODE_OFF )
    u8g2_SetPowerSave(&u8g2, 1);

  
  PWR->CR |= PWR_CR_PDDS;				/* Power Down Deepsleep */
  SCB->SCR |= SCB_SCR_SLEEPDEEP_Msk;	/* set the cortex M0+ deep sleep flag */  
  __DSB();  							/* finish memory access */
  __WFI();								/* enter deep sleep */
  __NOP();
}

/*
  ch 0..15: 	GPIO
  ch 16:		???
  ch 17:		vref (bandgap)
  ch18:		temperature sensor

  returns 12 bit result, right aligned 
*/
uint16_t readADC(uint8_t ch)
{
  uint32_t data;
  uint32_t i;
  
  __disable_irq();
  
  /* ADC RESET */
  
  RCC->APB2ENR |= RCC_APB2ENR_ADCEN;	/* enable ADC clock */
  __NOP();								/* let us wait for some time */
  __NOP();								/* let us wait for some time */  
  RCC->APB2RSTR |= RCC_APB2RSTR_ADCRST;
  __NOP();								/* let us wait for some time */
  __NOP();								/* let us wait for some time */
  RCC->APB2RSTR &= ~RCC_APB2RSTR_ADCRST;
  __NOP();								/* let us wait for some time */
  __NOP();								/* let us wait for some time */
  

  /* Enable some basic parts */
  
  ADC1->IER = 0;						/* do not allow any interrupts */
  ADC1->CFGR2 &= ~ADC_CFGR2_CKMODE;	/* select HSI16 clock */
  
  ADC1->CR |= ADC_CR_ADVREGEN;				/* enable ADC voltage regulator, probably not required, because this is automatically activated */
  ADC->CCR |= ADC_CCR_VREFEN; 			/* Wake-up the VREFINT */  
  ADC->CCR |= ADC_CCR_TSEN; 			/* Wake-up the temperature sensor */  

  __NOP();								/* let us wait for some time */
  __NOP();								/* let us wait for some time */

  /* CALIBRATION */
  
  if ((ADC1->CR & ADC_CR_ADEN) != 0) /* clear ADEN flag if required */
  {
    ADC1->CR &= (uint32_t)(~ADC_CR_ADEN);
  }
  ADC1->CR |= ADC_CR_ADCAL; 				/* start calibration */
  while ((ADC1->ISR & ADC_ISR_EOCAL) == 0) 	/* wait for clibration finished */
  {
  }
  ADC1->ISR |= ADC_ISR_EOCAL; 			/* clear the status flag, by writing 1 to it */
  __NOP();								/* not sure why, but some nop's are required here, at least 4 of them */
  __NOP();
  __NOP();
  __NOP();
  __NOP();
  __NOP();

  /* ENABLE ADC */
  
  ADC1->ISR |= ADC_ISR_ADRDY; 			/* clear ready flag */
  ADC1->CR |= ADC_CR_ADEN; 			/* enable ADC */
  while ((ADC1->ISR & ADC_ISR_ADRDY) == 0) /* wait for ADC */
  {
  }
  
  //printBits(5, ADC1->ISR );
  //printBits(6, ADC1->CR );

  /* CONFIGURE ADC */

  ADC1->CFGR1 &= ~ADC_CFGR1_EXTEN;	/* software enabled conversion start */
  ADC1->CFGR1 &= ~ADC_CFGR1_ALIGN;		/* right alignment */
  ADC1->CFGR1 &= ~ADC_CFGR1_RES;		/* 12 bit resolution */
  ADC1->CHSELR = 1<<ch; 				/* Select channel */
  ADC1->SMPR |= ADC_SMPR_SMP_0 | ADC_SMPR_SMP_1 | ADC_SMPR_SMP_2; /* Select a sampling mode of 111 (very slow)*/

  /* DO CONVERSION */
  
  data = 0;
  for( i = 0; i < 8; i++ )
  {
    
    ADC1->CR |= ADC_CR_ADSTART; /* start the ADC conversion */
    while ((ADC1->ISR & ADC_ISR_EOC) == 0) /* wait end of conversion */
    {
    }
    data += ADC1->DR;						/* get ADC result and clear the ISR_EOC flag */
  }
  data >>= 3;
  
  /* DISABLE ADC */
  
  /* at this point the end of sampling and end of sequence bits are also set in ISR registr */  
  if ( (ADC1->CR & ADC_CR_ADEN) != 0 )
  {
    ADC1->CR |= ADC_CR_ADDIS; 			/* disable ADC... maybe better execute a reset */
    while ((ADC1->CR & ADC_CR_ADEN) != 0) 	/* wait for ADC disable, ADEN is also cleared */
    {
    }
  }

  /* DISABLE OTHER PARTS, INCLUDING CLOCK */
  
  ADC->CCR &= ~ADC_CCR_VREFEN; 		/* disable VREFINT */  
  ADC->CCR &= ~ADC_CCR_TSEN; 			/* disable temperature sensor */  
  ADC1->CR &= ~ADC_CR_ADVREGEN;		/* disable ADC voltage regulator */
  RCC->APB2ENR &= ~RCC_APB2ENR_ADCEN;	/* disable ADC clock */
  
  __enable_irq();
  return data;
}

uint16_t getTemperature(void)
{
  int16_t y1, y2,x1, x2, t;
  int16_t y;
  
  
  y1 = 30;
  x1 = *(uint16_t *)(0x1FF8007A);	// 30 degree with 3.0V
  x1 *=30;
  x1 /=33;
  y2 = 110;		// AN3964: 110 degree, Datasheet: 130 degree
  x2 = *(uint16_t *)(0x1FF8007E);	// 130 degree with 3.0V
  x2 *=30;
  x2 /=33;
  t = readADC(18);
  
  y = ( (y2 - y1) * ( t - x1) ) / (x2 - x1) + y1;
  
  return y;
}


/*=======================================================================*/
int main()
{
  int i;
  uint16_t adc;
  startHSIClock();						/* Increase system clock, must be executed after each reset */
  SystemCoreClockUpdate();				/* Update variable SystemCoreClock, must be executed after each reset */
  startUp();							/* basic system setup + make a backup of PWR_CSR (PWR_CSR_Backup), must be executed after each reset */
  startSysTick();						/* start the sys tick interrupt, must be executed after each reset */
  

  /* LED output line */
  GPIOA->MODER &= ~GPIO_MODER_MODE13;	/* clear mode for PA13 */
  GPIOA->MODER |= GPIO_MODER_MODE13_0;	/* Output mode for PA13 */
  GPIOA->OTYPER &= ~GPIO_OTYPER_OT_13;	/* Push/Pull for PA13 */
  GPIOA->OSPEEDR &= ~GPIO_OSPEEDER_OSPEED13;	/* low speed for PA13 */
  GPIOA->PUPDR &= ~GPIO_PUPDR_PUPD13;	/* no pullup/pulldown for PA13 */
  GPIOA->BSRR = GPIO_BSRR_BR_13;		/* atomic clr PA13 */
  GPIOA->BSRR = GPIO_BSRR_BS_13;		/* atomic set PA13 */


  /* the lowest two bits of the PWR_CSR reg indicate wake up from standby (bit 1) and WUF als source (bit 0) */
  /* both bits are 0 for POR and button reset, both bits are 1 for a wakeup reset */
  /* bits	|	root cause */
  /* 00	|	POR or NVIC		--> perform full setup */
  /* 11	|	Standby + WUF 	--> continue with main screen */
  /* 01	|	NVIC-Reset 		--> perform full setup */
  /* we check bit 1 only */
  
