olikraus/u8g2/sys/arm/stm32l031x6/clock/main.c
  switch(PWR_CSR_Backup & 3)
  {
    case 0: 	/* Power on reset */
      ResetReason = RESET_REASON_POR; 
      break;
    case 1: 	/* reset by NVIC_SystemReset() */
      ResetReason = RESET_REASON_NVIC_RESET; 
      break;
    default:	/* probably a reset caused by RTC */
      /* analyse RTC_ISR register */
      if ( RTC->ISR & RTC_ISR_TAMP2F )
	ResetReason = RESET_REASON_TAMP2; 
      else if ( RTC->ISR & RTC_ISR_TAMP3F )
	ResetReason = RESET_REASON_TAMP3; 
      else 
	ResetReason = RESET_REASON_WUF;	
      break;
  }

  if ( ResetReason == RESET_REASON_POR || ResetReason == RESET_REASON_NVIC_RESET )
  {
    unsigned int r;
    /* Power on reset */
    r = initRTC();
    readRTC();
    initDisplay(1);	/* init display assumes proper values in gui_data */
    if ( r == 0 )
    {
	u8g2_ClearBuffer(&u8g2);
	u8g2_SetFont(&u8g2, MENU_NORMAL_FONT);
	u8g2_DrawStr(&u8g2, 0, 15, "No RTC Clock");
	u8g2_SendBuffer(&u8g2);      
	delay_micro_seconds(3000000);      
	do_reset();
    }
  }
  else
  {
    /* Reset caused by wakeup */
    
    /* we probably have to clear the RTC detection flags for WUF and TAMPER */
    /* this is done later in startRTCWakeUp() */
     
    readRTC();		
    
    /* do a warm start of the display, this means that the display reset is skipped and the init sequence is not sent */
    initDisplay(0);	/* init display assumes proper values in gui_data, additionally the alarm flag might be set here */
  }
  

  if ( DisplayStandbyMode != DISPLAY_STANDYB_MODE_ALWAYS_ON )
  {
    /* before the RTC is enabled via startRTCWakeUp(), avoid key detection if we are in any other mode than ALWAYS_ON  */
    if ( ResetReason == RESET_REASON_TAMP2 || ResetReason == RESET_REASON_TAMP3 )
      isIgnoreNextKey = 1;
  }
  
  startRTCWakeUp();						/* setup wakeup and temper, enable RTC IRQ, probably required after each reset */

  NVIC_SetPriority(RTC_IRQn, 0);
  NVIC_EnableIRQ(RTC_IRQn);
  

  if ( ResetReason == RESET_REASON_WUF && gui_data.is_alarm == 0 )
  {
    /* update current time */
    u8g2_ClearBuffer(&u8g2);
    GPIOA->BSRR = GPIO_BSRR_BR_13;		/* atomic set PA13 */
    gui_Draw();
    
    GPIOA->BSRR = GPIO_BSRR_BS_13;		/* atomic clr PA13 */
    u8g2_SendBuffer(&u8g2);
    /* go back to sleep mode */
    enterStandByMode();
  }
  
  /* turn on display now */
  u8g2_SetPowerSave(&u8g2, 0);	/* not required for the ALWAYS_ON mode, but does not matter in the other modes */
  u8g2_SetContrast(&u8g2, DISPLAY_CONTRAST_NORMAL);
  
  /* get current voltage level of the battery */
  adc = readADC(5);	
  
  for(;;)
  {
    if ( gui_menu.me_list == melist_display_time )
    {
      readRTC();
      gui_SignalTimeChange();
    }
    
    u8g2_ClearBuffer(&u8g2);
    GPIOA->BSRR = GPIO_BSRR_BR_13;		/* atomic set PA13 */
    gui_Draw();
    if ( gui_menu.me_list == melist_display_time )
    {
      u8g2_SetFont(&u8g2, MENU_NORMAL_FONT);
      u8g2_DrawStr(&u8g2, 0, 8, u8x8_u16toa((adc*330UL)>>12, 3));
    }
    GPIOA->BSRR = GPIO_BSRR_BS_13;		/* atomic clr PA13 */
    u8g2_SendBuffer(&u8g2);
    
    for(;;)
    {
      i = key_get();
      if ( i == KEY_NONE )
	break;
      if ( i == KEY_SELECT )
	gui_Select();
      if ( i == KEY_NEXT )
	gui_Next();      
    }
    
    if ( MenuIdleTimer > MENU_IDLE_SYSTICK_TIMEOUT && gui_data.is_equal == 0 )
    {
      
      if ( gui_menu.me_list != melist_display_time )
      {
	/* jump back to the display menu and redraw the time. not sure if this is required */
	menu_SetMEList(&gui_menu, melist_display_time, 0);
	readRTC();
	gui_SignalTimeChange();
	u8g2_ClearBuffer(&u8g2);
	gui_Draw();
	u8g2_SetFont(&u8g2, MENU_NORMAL_FONT);
	u8g2_DrawStr(&u8g2, 0, 8, u8x8_u16toa((adc*330UL)>>12, 3));
	u8g2_SendBuffer(&u8g2);
      }
      
      /* stop everything except RTC */
      enterStandByMode();
    }

  }
}
